# 2. На плоскости заданы координаты трех точек.
# Определить, можно ли по этим точкам построить треугольник.
# Если да, то найти радиусы вписанной и описанной окружностей.

x1 = float(input("Введите кординату х точки 1: "))
y1 = float(input("Введите кординату y точки 1: "))
x2 = float(input("Введите кординату х точки 2: "))
y2 = float(input("Введите кординату y точки 2: "))
x3 = float(input("Введите кординату х точки 3: "))
y3 = float(input("Введите кординату y точки 3: "))
X1 = x1 - x2
X2 = x3 - x2
Y1 = y1 - y2
Y2 = y3 - y2
try:
    if X1 / X2 != Y1 / Y2:
        i = 1
    else:
        i = 0
except ZeroDivisionError:
    if (X2 == 0 and y2 != y3) or (Y2 == 0 and x2 != x3):
        i = 1
    else:
        i = 0
if i == 1:
    a = (pow((x1 - x2), 2) + pow((y1 - y2), 2))**0.5
    b = (pow((x2 - x3), 2) + pow((y2 - y3), 2))**0.5
    c = (pow((x1 - x3), 2) + pow((y1 - y3), 2))**0.5
    p = (a + b + c) / 2
    S = (p * (p - a) * (p - b) * (p - c))**0.5
    r = S / p
    R = a * b * c / (4 * S)
    print("r = ", r, "  R = ", R)
else:
    print("Треугольник построить нельзя!")
